performance-testing/results/summary.txt
REMOVING EXISTING RESULTS
PERFORMING read TESTS
----------------------
running performance test for the benchmark server

          /\      |‾‾|  /‾‾/  /‾/
     /\  /  \     |  |_/  /  / /
    /  \/    \    |      |  /  ‾‾\
   /          \   |  |‾\  \ | (_) |
  / __________ \  |__|  \__\ \___/ .io

    init [----------------------------------------------------------]   collecto  execution: local
     output: json=performance-testing/results/benchmark-read.json; datadog (localhost:8125)
     script: performance-testing/scripts/benchmark-read.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0
    data_received..............: 1.8 MB  17 kB/s
    data_sent..................: 193 kB  1.8 kB/s
    http_req_blocked...........: avg=50.95µs  min=1µs     med=6µs     max=5.89ms   p(90)=13µs     p(95)=18µs
    http_req_connecting........: avg=24.63µs  min=0s      med=0s      max=3.79ms   p(90)=0s       p(95)=0s
    http_req_duration..........: avg=71.72ms  min=13.22ms med=45.42ms max=808.14ms p(90)=137.42ms p(95)=209.47ms
    http_req_receiving.........: avg=159.53µs min=42µs    med=85µs    max=5.77ms   p(90)=188.4µs  p(95)=354.04µs
    http_req_sending...........: avg=50.49µs  min=9µs     med=25µs    max=5.2ms    p(90)=45µs     p(95)=66.04µs
    http_req_tls_handshaking...: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s
    http_req_waiting...........: avg=71.51ms  min=13.08ms med=45.28ms max=807.85ms p(90)=137.27ms p(95)=209.39ms
    http_reqs..................: 1000    9.25658/s
    iteration_duration.........: avg=1.07s    min=1.01s   med=1.04s   max=1.81s    p(90)=1.13s    p(95)=1.21s
    iterations.................: 1000    9.25658/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
running performance test for styx server - using 5 nodes

          /\      |‾‾|  /‾‾/  /‾/
     /\  /  \     |  |_/  /  / /
    /  \/    \    |      |  /  ‾‾\
   /          \   |  |‾\  \ | (_) |
  / __________ \  |__|  \__\ \___/ .io

    init [----------------------------------------------------------]   collecto  execution: local
     output: json=performance-testing/results/styx-read-5.json; datadog (localhost:8125)
     script: performance-testing/scripts/styx-read.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

 running [==========================================================] 1000 / 100 running [==========================================================] 1000 / 100    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0
    data_received..............: 1.8 MB  13 kB/s
    data_sent..................: 179 kB  1.3 kB/s
    http_req_blocked...........: avg=20.07µs  min=2µs     med=6µs      max=1.64ms p(90)=11µs     p(95)=17µs
    http_req_connecting........: avg=5.55µs   min=0s      med=0s       max=741µs  p(90)=0s       p(95)=0s
    http_req_duration..........: avg=411.84ms min=73.2ms  med=280.1ms  max=3s     p(90)=859.4ms  p(95)=1.15s
    http_req_receiving.........: avg=93.63µs  min=49µs    med=82µs     max=1.73ms p(90)=121µs    p(95)=135.04µs
    http_req_sending...........: avg=33.51µs  min=10µs    med=27µs     max=540µs  p(90)=43.1µs   p(95)=55.04µs
    http_req_tls_handshaking...: avg=0s       min=0s      med=0s       max=0s     p(90)=0s       p(95)=0s
    http_req_waiting...........: avg=411.71ms min=73.06ms med=279.95ms max=3s     p(90)=859.28ms p(95)=1.15s
    http_reqs..................: 1000    7.033519/s
    iteration_duration.........: avg=1.41s    min=1.07s   med=1.28s    max=4s     p(90)=1.85s    p(95)=2.15s
    iterations.................: 1000    7.033519/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
styx-db-1
running performance test for styx server - using 4 nodes

          /\      |‾‾|  /‾‾/  /‾/
     /\  /  \     |  |_/  /  / /
    /  \/    \    |      |  /  ‾‾\
   /          \   |  |‾\  \ | (_) |
  / __________ \  |__|  \__\ \___/ .io

    init [----------------------------------------------------------]   collecto  execution: local
     output: json=performance-testing/results/styx-read-4.json; datadog (localhost:8125)
     script: performance-testing/scripts/styx-read.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

 running [==========================================================] 1000 / 100    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0
    data_received..............: 1.8 MB  13 kB/s
    data_sent..................: 179 kB  1.3 kB/s
    http_req_blocked...........: avg=47.1µs   min=3µs     med=6µs      max=7.91ms p(90)=11µs     p(95)=17µs
    http_req_connecting........: avg=23.64µs  min=0s      med=0s       max=5.85ms p(90)=0s       p(95)=0s
    http_req_duration..........: avg=341.88ms min=74.97ms med=234.32ms max=2.1s   p(90)=704.53ms p(95)=1.01s
    http_req_receiving.........: avg=93.74µs  min=51µs    med=83µs     max=1.36ms p(90)=114µs    p(95)=130.04µs
    http_req_sending...........: avg=44.57µs  min=11µs    med=26µs     max=2.96ms p(90)=41µs     p(95)=50.04µs
    http_req_tls_handshaking...: avg=0s       min=0s      med=0s       max=0s     p(90)=0s       p(95)=0s
    http_req_waiting...........: avg=341.74ms min=74.86ms med=234.18ms max=2.1s   p(90)=704.43ms p(95)=1.01s
    http_reqs..................: 1000    7.409047/s
    iteration_duration.........: avg=1.34s    min=1.07s   med=1.23s    max=3.1s   p(90)=1.7s     p(95)=2.01s
    iterations.................: 1000    7.409047/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
styx-db-2
running performance test for styx server - using 3 nodes

          /\      |‾‾|  /‾‾/  /‾/
     /\  /  \     |  |_/  /  / /
    /  \/    \    |      |  /  ‾‾\
   /          \   |  |‾\  \ | (_) |
  / __________ \  |__|  \__\ \___/ .io

    init [----------------------------------------------------------]   collecto  execution: local
     output: json=performance-testing/results/styx-read-3.json; datadog (localhost:8125)
     script: performance-testing/scripts/styx-read.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 100    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0
    data_received..............: 1.8 MB  14 kB/s
    data_sent..................: 179 kB  1.4 kB/s
    http_req_blocked...........: avg=27.25µs  min=3µs     med=6µs      max=2.94ms p(90)=12µs     p(95)=17µs
    http_req_connecting........: avg=10.59µs  min=0s      med=0s       max=1.58ms p(90)=0s       p(95)=0s
    http_req_duration..........: avg=247.81ms min=75.94ms med=169.59ms max=1.92s  p(90)=406.68ms p(95)=875.34ms
    http_req_receiving.........: avg=99.03µs  min=51µs    med=84µs     max=1.27ms p(90)=126µs    p(95)=161µs
    http_req_sending...........: avg=38.12µs  min=13µs    med=27µs     max=1.46ms p(90)=45µs     p(95)=57.04µs
    http_req_tls_handshaking...: avg=0s       min=0s      med=0s       max=0s     p(90)=0s       p(95)=0s
    http_req_waiting...........: avg=247.67ms min=75.84ms med=169.42ms max=1.92s  p(90)=406.52ms p(95)=875.26ms
    http_reqs..................: 1000    7.974271/s
    iteration_duration.........: avg=1.24s    min=1.07s   med=1.17s    max=2.92s  p(90)=1.4s     p(95)=1.87s
    iterations.................: 1000    7.974271/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
styx-db-3
running performance test for styx server - using 2 nodes

          /\      |‾‾|  /‾‾/  /‾/
     /\  /  \     |  |_/  /  / /
    /  \/    \    |      |  /  ‾‾\
   /          \   |  |‾\  \ | (_) |
  / __________ \  |__|  \__\ \___/ .io

    init [----------------------------------------------------------]   collecto  execution: local
     output: json=performance-testing/results/styx-read-2.json; datadog (localhost:8125)
     script: performance-testing/scripts/styx-read.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0
    data_received..............: 1.8 MB  13 kB/s
    data_sent..................: 179 kB  1.3 kB/s
    http_req_blocked...........: avg=46.41µs  min=3µs     med=6µs      max=10.91ms p(90)=14µs     p(95)=19µs
    http_req_connecting........: avg=15.4µs   min=0s      med=0s       max=8.52ms  p(90)=0s       p(95)=0s
    http_req_duration..........: avg=347.95ms min=74.18ms med=211.91ms max=3.17s   p(90)=673.73ms p(95)=1.27s
    http_req_receiving.........: avg=100.16µs min=47µs    med=86µs     max=1.03ms  p(90)=131µs    p(95)=167.19µs
    http_req_sending...........: avg=49.34µs  min=11µs    med=27µs     max=3.13ms  p(90)=47µs     p(95)=66µs
    http_req_tls_handshaking...: avg=0s       min=0s      med=0s       max=0s      p(90)=0s       p(95)=0s
    http_req_waiting...........: avg=347.8ms  min=74.05ms med=211.77ms max=3.17s   p(90)=673.59ms p(95)=1.26s
    http_reqs..................: 1000    7.372981/s
    iteration_duration.........: avg=1.35s    min=1.07s   med=1.21s    max=4.18s   p(90)=1.67s    p(95)=2.27s
    iterations.................: 1000    7.372981/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
styx-db-4
running performance test for styx server - using 1 node

          /\      |‾‾|  /‾‾/  /‾/
     /\  /  \     |  |_/  /  / /
    /  \/    \    |      |  /  ‾‾\
   /          \   |  |‾\  \ | (_) |
  / __________ \  |__|  \__\ \___/ .io

    init [----------------------------------------------------------]   collecto  execution: local
     output: json=performance-testing/results/styx-read-1.json; datadog (localhost:8125)
     script: performance-testing/scripts/styx-read.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

 running [==========================================================] 1000 / 100    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0
    data_received..............: 1.8 MB  14 kB/s
    data_sent..................: 179 kB  1.4 kB/s
    http_req_blocked...........: avg=270.9µs  min=2µs     med=6µs      max=31.45ms p(90)=11µs     p(95)=15.04µs
    http_req_connecting........: avg=141.06µs min=0s      med=0s       max=27.3ms  p(90)=0s       p(95)=0s
    http_req_duration..........: avg=250.65ms min=68.72ms med=159.37ms max=2.19s   p(90)=385.85ms p(95)=755.91ms
    http_req_receiving.........: avg=97.75µs  min=50µs    med=81µs     max=3.52ms  p(90)=113µs    p(95)=143µs
    http_req_sending...........: avg=148µs    min=12µs    med=27µs     max=16.88ms p(90)=47.1µs   p(95)=67µs
    http_req_tls_handshaking...: avg=0s       min=0s      med=0s       max=0s      p(90)=0s       p(95)=0s
    http_req_waiting...........: avg=250.41ms min=68.61ms med=159.25ms max=2.19s   p(90)=385.7ms  p(95)=755.83ms
    http_reqs..................: 1000    7.959241/s
    iteration_duration.........: avg=1.25s    min=1.06s   med=1.16s    max=3.19s   p(90)=1.38s    p(95)=1.75s
    iterations.................: 1000    7.959241/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10


PERFORMING write TESTS
----------------------
running performance test for the benchmark server

          /\      |‾‾|  /‾‾/  /‾/
     /\  /  \     |  |_/  /  / /
    /  \/    \    |      |  /  ‾‾\
   /          \   |  |‾\  \ | (_) |
  / __________ \  |__|  \__\ \___/ .io

    init [----------------------------------------------------------]   collecto  execution: local
     output: json=performance-testing/results/benchmark-write.json; datadog (localhost:8125)
     script: performance-testing/scripts/benchmark-write.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0
    data_received..............: 1.3 MB  12 kB/s
    data_sent..................: 212 kB  2.0 kB/s
    http_req_blocked...........: avg=23.23µs min=2µs     med=6µs     max=2.3ms    p(90)=14µs    p(95)=21µs
    http_req_connecting........: avg=7.49µs  min=0s      med=0s      max=902µs    p(90)=0s      p(95)=0s
    http_req_duration..........: avg=36.28ms min=12.83ms med=31.58ms max=335.23ms p(90)=48.79ms p(95)=65.16ms
    http_req_receiving.........: avg=109.2µs min=50µs    med=88µs    max=1.15ms   p(90)=158µs   p(95)=241.04µs
    http_req_sending...........: avg=34.68µs min=11µs    med=28µs    max=686µs    p(90)=48.1µs  p(95)=67.04µs
    http_req_tls_handshaking...: avg=0s      min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s
    http_req_waiting...........: avg=36.14ms min=12.73ms med=31.41ms max=334.92ms p(90)=48.63ms p(95)=64.96ms
    http_reqs..................: 1000    9.593398/s
    iteration_duration.........: avg=1.03s   min=1.01s   med=1.03s   max=1.33s    p(90)=1.04s   p(95)=1.06s
    iterations.................: 1000    9.593398/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
running performance test for styx server - using 5 nodes

          /\      |‾‾|  /‾‾/  /‾/
     /\  /  \     |  |_/  /  / /
    /  \/    \    |      |  /  ‾‾\
   /          \   |  |‾\  \ | (_) |
  / __________ \  |__|  \__\ \___/ .io

    init [----------------------------------------------------------]   collecto  execution: local
     output: json=performance-testing/results/styx-write-5.json; datadog (localhost:8125)
     script: performance-testing/scripts/styx-write.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

 running [==========================================================] 1000 / 100    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0
    data_received..............: 1.3 MB  5.0 kB/s
    data_sent..................: 198 kB  767 B/s
    http_req_blocked...........: avg=56.19µs min=4µs      med=6µs  max=10.69ms p(90)=9µs   p(95)=14µs
    http_req_connecting........: avg=35.55µs min=0s       med=0s   max=9.82ms  p(90)=0s    p(95)=0s
    http_req_duration..........: avg=1.56s   min=915.31ms med=1.5s max=4.84s   p(90)=1.82s p(95)=2.04s
    http_req_receiving.........: avg=87.37µs min=51µs     med=84µs max=428µs   p(90)=104µs p(95)=114µs
    http_req_sending...........: avg=38.95µs min=18µs     med=27µs max=2.3ms   p(90)=37µs  p(95)=47µs
    http_req_tls_handshaking...: avg=0s      min=0s       med=0s   max=0s      p(90)=0s    p(95)=0s
    http_req_waiting...........: avg=1.56s   min=915.2ms  med=1.5s max=4.84s   p(90)=1.82s p(95)=2.04s
    http_reqs..................: 1000    3.877161/s
    iteration_duration.........: avg=2.57s   min=1.91s    med=2.5s max=5.85s   p(90)=2.82s p(95)=3.04s
    iterations.................: 1000    3.877161/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
styx-db-1
running performance test for styx server - using 4 nodes

          /\      |‾‾|  /‾‾/  /‾/
     /\  /  \     |  |_/  /  / /
    /  \/    \    |      |  /  ‾‾\
   /          \   |  |‾\  \ | (_) |
  / __________ \  |__|  \__\ \___/ .io

    init [----------------------------------------------------------]   collecto  execution: local
     output: json=performance-testing/results/styx-write-4.json; datadog (localhost:8125)
     script: performance-testing/scripts/styx-write.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0
    data_received..............: 1.3 MB  6.0 kB/s
    data_sent..................: 198 kB  906 B/s
    http_req_blocked...........: avg=22.21µs min=4µs      med=6µs   max=2.35ms p(90)=10µs  p(95)=16µs
    http_req_connecting........: avg=7.72µs  min=0s       med=0s    max=1.82ms p(90)=0s    p(95)=0s
    http_req_duration..........: avg=1.17s   min=758.09ms med=1.13s max=3.36s  p(90)=1.36s p(95)=1.44s
    http_req_receiving.........: avg=87.79µs min=58µs     med=84µs  max=728µs  p(90)=103µs p(95)=113µs
    http_req_sending...........: avg=35.62µs min=19µs     med=27µs  max=1.02ms p(90)=40µs  p(95)=62µs
    http_req_tls_handshaking...: avg=0s      min=0s       med=0s    max=0s     p(90)=0s    p(95)=0s
    http_req_waiting...........: avg=1.17s   min=757.99ms med=1.13s max=3.36s  p(90)=1.36s p(95)=1.44s
    http_reqs..................: 1000    4.579695/s
    iteration_duration.........: avg=2.17s   min=1.76s    med=2.14s max=4.36s  p(90)=2.36s p(95)=2.45s
    iterations.................: 1000    4.579695/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
styx-db-2
running performance test for styx server - using 3 nodes

          /\      |‾‾|  /‾‾/  /‾/
     /\  /  \     |  |_/  /  / /
    /  \/    \    |      |  /  ‾‾\
   /          \   |  |‾\  \ | (_) |
  / __________ \  |__|  \__\ \___/ .io

    init [----------------------------------------------------------]   collecto  execution: local
     output: json=performance-testing/results/styx-write-3.json; datadog (localhost:8125)
     script: performance-testing/scripts/styx-write.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0
    data_received..............: 1.3 MB  7.0 kB/s
    data_sent..................: 198 kB  1.1 kB/s
    http_req_blocked...........: avg=56.69µs  min=4µs      med=6µs      max=12.23ms p(90)=9µs      p(95)=14µs
    http_req_connecting........: avg=29.15µs  min=0s       med=0s       max=10.16ms p(90)=0s       p(95)=0s
    http_req_duration..........: avg=835.89ms min=433.07ms med=774.76ms max=3.23s   p(90)=987.81ms p(95)=1.11s
    http_req_receiving.........: avg=87.53µs  min=54µs     med=84µs     max=556µs   p(90)=103.1µs  p(95)=115.04µs
    http_req_sending...........: avg=54.71µs  min=20µs     med=27µs     max=6.23ms  p(90)=39.1µs   p(95)=56.04µs
    http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s
    http_req_waiting...........: avg=835.75ms min=432.96ms med=774.66ms max=3.23s   p(90)=987.69ms p(95)=1.11s
    http_reqs..................: 1000    5.415931/s
    iteration_duration.........: avg=1.83s    min=1.43s    med=1.77s    max=4.26s   p(90)=1.98s    p(95)=2.11s
    iterations.................: 1000    5.415931/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
styx-db-3
running performance test for styx server - using 2 nodes

          /\      |‾‾|  /‾‾/  /‾/
     /\  /  \     |  |_/  /  / /
    /  \/    \    |      |  /  ‾‾\
   /          \   |  |‾\  \ | (_) |
  / __________ \  |__|  \__\ \___/ .io

    init [----------------------------------------------------------]   collecto  execution: local
     output: json=performance-testing/results/styx-write-2.json; datadog (localhost:8125)
     script: performance-testing/scripts/styx-write.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0
    data_received..............: 1.3 MB  8.5 kB/s
    data_sent..................: 198 kB  1.3 kB/s
    http_req_blocked...........: avg=29.55µs  min=4µs      med=6µs      max=3.82ms p(90)=10µs     p(95)=14.04µs
    http_req_connecting........: avg=6.51µs   min=0s       med=0s       max=861µs  p(90)=0s       p(95)=0s
    http_req_duration..........: avg=524.2ms  min=178.6ms  med=454.78ms max=2.44s  p(90)=657.29ms p(95)=1.36s
    http_req_receiving.........: avg=90.2µs   min=52µs     med=83µs     max=1.77ms p(90)=103µs    p(95)=113µs
    http_req_sending...........: avg=44.3µs   min=20µs     med=27µs     max=2.83ms p(90)=39µs     p(95)=54µs
    http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s     p(90)=0s       p(95)=0s
    http_req_waiting...........: avg=524.07ms min=178.48ms med=454.64ms max=2.44s  p(90)=657.17ms p(95)=1.36s
    http_reqs..................: 1000    6.516164/s
    iteration_duration.........: avg=1.52s    min=1.18s    med=1.45s    max=3.44s  p(90)=1.66s    p(95)=2.36s
    iterations.................: 1000    6.516164/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
styx-db-4
running performance test for styx server - using 1 node

          /\      |‾‾|  /‾‾/  /‾/
     /\  /  \     |  |_/  /  / /
    /  \/    \    |      |  /  ‾‾\
   /          \   |  |‾\  \ | (_) |
  / __________ \  |__|  \__\ \___/ .io

    init [----------------------------------------------------------]   collecto  execution: local
     output: json=performance-testing/results/styx-write-1.json; datadog (localhost:8125)
     script: performance-testing/scripts/styx-write.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0
    data_received..............: 1.3 MB  10 kB/s
    data_sent..................: 198 kB  1.6 kB/s
    http_req_blocked...........: avg=44.23µs  min=3µs     med=6µs      max=5.03ms p(90)=11µs     p(95)=16µs
    http_req_connecting........: avg=26.91µs  min=0s      med=0s       max=4.04ms p(90)=0s       p(95)=0s
    http_req_duration..........: avg=233.01ms min=98.85ms med=207.85ms max=1.49s  p(90)=321.91ms p(95)=429.28ms
    http_req_receiving.........: avg=88.39µs  min=50µs    med=82.5µs   max=1.13ms p(90)=103µs    p(95)=117.04µs
    http_req_sending...........: avg=37.89µs  min=14µs    med=27µs     max=1.54ms p(90)=41.1µs   p(95)=52µs
    http_req_tls_handshaking...: avg=0s       min=0s      med=0s       max=0s     p(90)=0s       p(95)=0s
    http_req_waiting...........: avg=232.88ms min=98.75ms med=207.69ms max=1.49s  p(90)=321.81ms p(95)=429.15ms
    http_reqs..................: 1000    8.054285/s
    iteration_duration.........: avg=1.23s    min=1.1s    med=1.21s    max=2.49s  p(90)=1.32s    p(95)=1.43s
    iterations.................: 1000    8.054285/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10